Update to External ID service
